# Index Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeEndPoint..::..Index Property
EdgeEndPoint Class See Also
---
The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int Index { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Index As Integer
	Get
```

Visual C++
---
```text
public:
property int Index {
	int get ();
}
```

# See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace